{
  "backend/main.mo": "Defines core actor with authorization mixin, data types, maps for products, customers, bills, expenses, and owner login logic including password initialization and authentication.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions for numerous frontend files including app logic, screens, components, hooks, and offline storage behavior.",
  "frontend/android/.gitignore": "Specifies ignored Android build, configuration, and IDE files for the Android wrapper project.",
  "frontend/android/app/build.gradle": "Gradle build configuration for the Android wrapper, including SDK settings, build types, dependencies, and PWA URL validation task.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules preserving WebView interfaces, Kotlin metadata, and wrapper classes for release builds.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Manifest defining permissions, app metadata, launch activity, deep linking, and configuration settings for the Android wrapper.",
  "frontend/android/app/src/main/java/com/frontline/wrapper/MainActivity.kt": "Android activity that initializes and configures a fullscreen WebView, enabling modern web features and handling navigation and errors.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Defines the round adaptive launcher icon referencing the same background and foreground assets.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Defines the adaptive app launcher icon using background and foreground drawables.",
  "frontend/android/app/src/main/res/values/colors.xml": "Provides the ic_launcher_background color value used by adaptive icons.",
  "frontend/android/app/src/main/res/values/strings.xml": "Contains app name, PWA URL config, and user-facing error/loading strings.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines the app themes, including primary colors and fullscreen configuration.",
  "frontend/android/build.gradle": "Top-level Gradle build configuration with Kotlin and Android plugin setup.",
  "frontend/android/dist/.gitkeep": "Placeholder file ensuring the dist directory is tracked in version control.",
  "frontend/android/gradle.properties": "Gradle settings enabling AndroidX, Jetifier, performance flags, and optional PWA URL injection.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures the Gradle wrapper to use Gradle 8.2 with distribution and timeout settings.",
  "frontend/android/README.md": "Documentation describing the Android WebView wrapper for the PWA, build requirements, configuration, and release validation steps.",
  "frontend/android/scripts/build-release-apk.sh": "Build script that validates PWA URL, compiles the release APK, verifies filename, and stages versioned output.",
  "frontend/android/scripts/publish-release-apk.sh": "Script that locates the latest built APK, computes metadata, and prepares it for publishing with a unique ID.",
  "frontend/android/settings.gradle": "Configures plugin management, repository resolution, and includes the app module.",
  "frontend/index.css": "Empty stylesheet placeholder for frontend styles.",
  "frontend/index.html": "Main HTML entry point loading the PWA, icons, and service worker with cache-busting build ID.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and standalone display configuration.",
  "frontend/public/sw.js": "Service worker implementing cache versioning, app shell caching, and network-first/navigation strategies.",
  "frontend/src/App.tsx": "Main React app controller handling authentication, profile loading, screen navigation, and build-version cache resets.",
  "frontend/src/auth/passwordAuth.tsx": "Provides a context-based password auth system with localStorage persistence and login/logout helpers.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with side navigation, mobile drawer, top bar, content area, and footer.",
  "frontend/src/components/AppStartupError.tsx": "Displays startup or authorization errors with retry, reset cache, and optional auth-clear actions.",
  "frontend/src/components/CustomerDialog.tsx": "Dialog for creating or editing customers with form handling and offline queue integration.",
  "frontend/src/components/MobileNavDrawer.tsx": "Mobile side drawer listing navigable screens with icons and active-state highlighting.",
  "frontend/src/components/ProductDialog.tsx": "Dialog for creating or updating products, validating fields and queuing offline actions.",
  "frontend/src/components/ResponsiveTableCards.tsx": "Renders data as card-style rows for small screens with a customizable empty state.",
  "frontend/src/components/RootErrorBoundary.tsx": "Global error boundary showing a fallback UI with reload and reset options.",
  "frontend/src/components/SideNav.tsx": "Renders a sidebar navigation menu and persists/restores the last selected screen using localStorage.",
  "frontend/src/components/SyncIndicator.tsx": "Displays online status, pending sync count, and errors with a retry option based on sync state.",
  "frontend/src/components/TopBar.tsx": "Shows the app header with menu button, title, sync indicator, and a user profile menu with logout.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and status handling through a React context.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA installability and exposes a function to trigger the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for authentication, user profiles, products, and other backend operations using the actor.",
  "frontend/src/hooks/useStartupWatchdog.ts": "Monitors startup loading phases and triggers a timeout with diagnostics if initialization hangs.",
  "frontend/src/index.css": "Defines Tailwind base layers, light/dark theme CSS variables, and forces opaque Radix UI overlays and sheet components.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, loading global styles.",
  "frontend/src/offline/storage.ts": "Provides localStorage-based caching and an offline action queue with add, remove, and retry utilities.",
  "frontend/src/offline/useOfflineQueue.ts": "React hook that executes actions immediately when online or queues them for later when offline.",
  "frontend/src/offline/useSyncStatus.ts": "Tracks online status and processes queued offline actions using the actor, updating pending counts and errors.",
  "frontend/src/screens/BillingScreen.tsx": "Billing UI that builds bill line items, validates inventory, calculates totals, and submits or queues bill creation.",
  "frontend/src/screens/CreditsScreen.tsx": "Displays customer credit summaries by aggregating bill data, with table and card views for different screen sizes.",
  "frontend/src/screens/CustomersScreen.tsx": "Displays and manages customers with admin‑only add, edit, and delete actions using offline queueing.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows summary stats for products, customers, bills, credits, and sync status, plus recent activity metrics.",
  "frontend/src/screens/LoginScreen.tsx": "Handles role‑based login with password auth, actor initialization checks, and error normalization.",
  "frontend/src/screens/ProductsScreen.tsx": "Lists products with stock indicators and admin‑only create, edit, and delete actions via offline queue.",
  "frontend/src/screens/ReportsScreen.tsx": "Generates sales and expense reports, and lets admins manage expenses with offline sync support.",
  "frontend/src/utils/authErrors.ts": "Normalizes backend auth errors into simplified user‑friendly messages.",
  "frontend/src/utils/billingTotals.ts": "Utilities for calculating billing totals, discounts, and GST, including legacy bill handling.",
  "frontend/src/utils/buildInfo.ts": "Defines a BUILD_ID constant used to detect and refresh deployments.",
  "frontend/src/utils/printInvoice.ts": "Generates formatted invoice HTML, consolidates product lines, computes totals, and triggers browser printing.",
  "frontend/src/utils/reporting.ts": "Provides functions for calculating daily sales, date‑range summaries, and profit data from bills, products, and expenses.",
  "frontend/src/utils/resetCachedApp.ts": "Clears storage, caches, and service workers, then reloads the page to reset the app.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling plugins.",
  "project_state.json": "Records project metadata, state version, known login issues, and feature requirements."
}