{
  "backend/main.mo": "Motoko actor implementing authorization and CRUD operations for products, customers, bills, expenses, and user profiles using map-based storage.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend TypeScript/React files detailing functionality and UI behavior.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, logs, and temporary files.",
  "frontend/android/app/build.gradle": "Gradle config defining app metadata, build types, dependencies, and a validation task blocking release builds with invalid PWA URLs.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules preserving WebView, Kotlin metadata, and wrapper classes for release builds.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest configuring permissions, app metadata, MainActivity, and deep linking support.",
  "frontend/android/app/src/main/java/com/frontline/wrapper/MainActivity.kt": "MainActivity hosting a configured fullscreen WebView that loads the PWA, manages navigation, and handles external links.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon definition using the same assets as the standard icon.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive icon definition referencing launcher background and foreground assets.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resource defining the launcher background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources including app name, error messages, and the configured PWA URL required for release builds.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines base and fullscreen Android themes and a background color.",
  "frontend/android/build.gradle": "Top-level Gradle config setting Kotlin version, repositories, and build plugins.",
  "frontend/android/dist/.gitkeep": "Empty placeholder file to keep dist directory in version control.",
  "frontend/android/gradle.properties": "Project-wide Gradle settings including JVM args, AndroidX flags, Kotlin style, and R8 mode.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures Gradle wrapper distribution and storage paths.",
  "frontend/android/README.md": "Documentation for the Android WebView wrapper explaining configuration, build requirements, and PWA URL setup.",
  "frontend/android/scripts/build-release-apk.sh": "Script that builds a release APK, validates config, stages output, and writes metadata.",
  "frontend/android/scripts/publish-release-apk.sh": "Script that publishes a built APK, generates metadata, and prepares for external upload.",
  "frontend/android/settings.gradle": "Configures plugin and dependency repositories and includes the app module.",
  "frontend/index.css": "Empty stylesheet placeholder for frontend.",
  "frontend/index.html": "Main HTML entry for the PWA with service worker registration and app bootstrap.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, and icons.",
  "frontend/public/sw.js": "Service worker handling caching, updates, and offline support with network-first logic.",
  "frontend/src/App.tsx": "Root React component managing auth state, profile loading, and screen routing.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing navigation, top bar, content area, and footer.",
  "frontend/src/components/AppStartupError.tsx": "Displays a startup error message with details and offers retry or cache-clearing options.",
  "frontend/src/components/CustomerDialog.tsx": "Provides a dialog for creating or editing customers, handling validation, offline queueing, and form state.",
  "frontend/src/components/ProductDialog.tsx": "Dialog for adding or editing products with validation, inventory unit handling, and offline queue integration.",
  "frontend/src/components/RootErrorBoundary.tsx": "A global error boundary that catches rendering errors and shows a recovery UI with reload and reset options.",
  "frontend/src/components/SideNav.tsx": "Renders the side navigation menu and persists the last selected screen in local storage.",
  "frontend/src/components/SyncIndicator.tsx": "Shows online/offline status, pending sync actions, and retry options for sync errors.",
  "frontend/src/components/TopBar.tsx": "Top navigation bar showing sync status, PWA install prompt, user info, and logout controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including creating AuthClient, loading stored identities, and controlling login state.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA installability state and provides a function to trigger the installation prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, products, customers, and related backend entities through an actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables, and applies specific styling overrides for Radix UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/offline/storage.ts": "Implements localStorage-backed caching and a queued action system for offline persistence and retries.",
  "frontend/src/offline/useOfflineQueue.ts": "Provides a hook to queue or immediately execute actions, storing failures for later retry.",
  "frontend/src/offline/useSyncStatus.ts": "Tracks online state and processes queued offline actions, syncing them via the actor and refreshing queries.",
  "frontend/src/screens/BillingScreen.tsx": "A billing interface that manages customers, products, bill lines, totals, GST, and bill creation with inventory checks and offline queue support.",
  "frontend/src/screens/CreditsScreen.tsx": "Displays credit summaries per customer using bill data, including pending status and an overall credit overview.",
  "frontend/src/screens/CustomersScreen.tsx": "Lists customers with add, edit, and delete actions, using dialogs, offline queueing, and mutation hooks.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows high-level stats for products, customers, bills, and credits, along with sync status and recent activity counts.",
  "frontend/src/screens/LoginScreen.tsx": "Handles login via Internet Identity and optional profile setup with name and role selection.",
  "frontend/src/screens/ProductsScreen.tsx": "Displays a product list with add, edit, and delete actions, using offline queueing and dialogs.",
  "frontend/src/screens/ReportsScreen.tsx": "Generates sales, expense, and profit reports with date filtering and expense creation via offline queue.",
  "frontend/src/utils/billingTotals.ts": "Provides functions to calculate billing totals including GST and compute totals for stored bills.",
  "frontend/src/utils/printInvoice.ts": "Builds and prints an invoice by consolidating line items and formatting totals into an HTML template.",
  "frontend/src/utils/reporting.ts": "Implements daily sales, date-range summaries, and profit calculations using bill, product, and expense data.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters for navigation and state persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theming with OKLCH-based colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the current PWA priorities, architecture notes, known issues, and a list of existing implemented features with metadata."
}