{
  "backend/main.mo": "Motoko backend actor with access control managing products, customers, bills, expenses, and user profiles in in-memory maps.",
  "feature_evidence.json": "Feature evidence report listing files and components related to packaging the PWA into an Android APK.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional descriptions for build planning.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, logs, and generated folders.",
  "frontend/android/app/build.gradle": "Android app module Gradle config defining SDK versions, build types, Kotlin settings, and dependencies.",
  "frontend/android/app/proguard-rules.pro": "ProGuard configuration preserving WebView, Kotlin metadata, and wrapper app classes.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Manifest specifying permissions, MainActivity setup, app theme, and deep-link handling.",
  "frontend/android/app/src/main/java/com/frontline/wrapper/MainActivity.kt": "MainActivity implementing fullscreen WebView wrapper with navigation handling, dark mode, and file upload support.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Adaptive round launcher icon definition.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon definition.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resource defining launcher background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "App string resources including app name, PWA URL, and error messages.",
  "frontend/android/app/src/main/res/values/styles.xml": "App themes defining colors, fullscreen mode, and styling for MainActivity.",
  "frontend/android/build.gradle": "Top-level Gradle config declaring Kotlin and Android Gradle plugin versions.",
  "frontend/android/gradle.properties": "Gradle settings enabling AndroidX, parallel builds, caching, and R8 full mode.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Gradle wrapper configuration pointing to Gradle 8.2 distribution.",
  "frontend/android/README.md": "Instructions for building the Android wrapper APK for the PWA, including prerequisites and Gradle usage.",
  "frontend/android/settings.gradle": "Project settings specifying repositories and including the app module.",
  "frontend/index.css": "Global stylesheet for the frontend (content not shown).",
  "frontend/index.html": "Main HTML entry point that sets PWA metadata, registers the service worker, and mounts the React app.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, launch settings, and app icons.",
  "frontend/public/sw.js": "Service worker handling install, activate, caching, and fetch logic for offline support.",
  "frontend/src/App.tsx": "Root React component managing authentication flow and rendering screens based on user state.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing sidebar, top bar, main content area, and footer around screen content.",
  "frontend/src/components/CustomerDialog.tsx": "Modal form for creating or updating customers with offline queue support and basic validation.",
  "frontend/src/components/ProductDialog.tsx": "Modal for adding or editing products with validation and support for offline queue actions.",
  "frontend/src/components/SideNav.tsx": "Sidebar navigation component listing app screens and handling screen switching.",
  "frontend/src/components/SyncIndicator.tsx": "UI indicator showing online status, pending sync actions, sync progress, and errors.",
  "frontend/src/components/TopBar.tsx": "Top bar showing title, sync indicator, install button, user profile, and logout control.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/logout state.",
  "frontend/src/hooks/usePWAInstall.ts": "Handles PWA installation prompts, tracking installability and triggering the install flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, customers, bills, profiles, and expenses via the actor.",
  "frontend/src/index.css": "Sets Tailwind layers, color variables, dark mode styles, and print styles for invoices.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/offline/storage.ts": "Implements localStorage-based caching and an offline action queue with retry metadata.",
  "frontend/src/offline/useOfflineQueue.ts": "Provides a hook to execute actions immediately or queue them offline when execution fails.",
  "frontend/src/offline/useSyncStatus.ts": "Tracks online status and processes queued offline actions, syncing them through the backend actor.",
  "frontend/src/screens/BillingScreen.tsx": "UI for creating bills with product selection, quantity handling, GST options, and inventory validation.",
  "frontend/src/screens/CreditsScreen.tsx": "Displays per-customer credit totals and statuses using bills and customer data.",
  "frontend/src/screens/CustomersScreen.tsx": "Lists customers and supports creating, editing, and deleting entries with offline queueing.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows high-level stats for products, customers, bills, credits, and sync status.",
  "frontend/src/screens/LoginScreen.tsx": "Handles Internet Identity login and optional user profile setup with name and role.",
  "frontend/src/screens/ProductsScreen.tsx": "Displays a products list with add, edit, and delete actions using queries and an offline queue.",
  "frontend/src/screens/ReportsScreen.tsx": "Generates sales, expense, and profit reports with date filtering and supports adding and deleting expenses.",
  "frontend/src/utils/billingTotals.ts": "Provides functions to calculate billing totals including GST and compute totals from stored bills.",
  "frontend/src/utils/printInvoice.ts": "Builds printable invoice HTML by consolidating bill items and calculating totals for printing.",
  "frontend/src/utils/reporting.ts": "Contains reporting helpers for daily sales, date-range summaries, and profit calculations using bills, expenses, and products.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color system, extended theming, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project's state, including versioning, architectural notes, features, and summaries for an Android inventory and billing app."
}