{
  "backend/main.mo": "Motoko backend actor defining types and CRUD operations for products, customers, bills, expenses, and user profiles with access control.",
  "feature_evidence.json": "Feature evidence report mapping Android wrapper tasks to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend React files and their purposes.",
  "frontend/android/.gitignore": "Gitignore rules for Android build outputs, IDE files, logs, and local configs.",
  "frontend/android/app/build.gradle": "Gradle config for the Android wrapper including versioning, build types, dependencies, and PWA URL validation.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules keeping WebView, Kotlin metadata, and wrapper classes during minification.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Manifest defining permissions, app metadata, launcher activity, and deep linking.",
  "frontend/android/app/src/main/java/com/frontline/wrapper/MainActivity.kt": "Main Android activity hosting a configured WebView that loads the PWA and handles navigation and file uploads.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Adaptive round icon definition referencing background and foreground assets.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive icon definition referencing background and foreground assets.",
  "frontend/android/app/src/main/res/values/colors.xml": "Color resources defining the launcher icon background color.",
  "frontend/android/app/src/main/res/values/strings.xml": "Defines app name, placeholder PWA URL, and basic error messages.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines app themes, colors, and fullscreen style variants.",
  "frontend/android/build.gradle": "Top-level Gradle config setting Kotlin and Android plugin versions and repositories.",
  "frontend/android/gradle.properties": "Project-wide Gradle settings including JVM args, AndroidX, Jetifier, and R8 options.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures Gradle wrapper distribution and storage paths.",
  "frontend/android/README.md": "Instructions for configuring the PWA URL and building the Android wrapper APK.",
  "frontend/android/scripts/build-release-apk.sh": "Shell script building the release APK with PWA URL validation and output reporting.",
  "frontend/android/settings.gradle": "Defines plugin management, repositories, root project name, and includes the app module.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Main HTML entry defining PWA metadata, service worker registration, and mounting root.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme colors, start URL, and icons.",
  "frontend/public/sw.js": "Service worker implementing install, activate, caching, and fetch handling for offline support.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile loading, and screen navigation.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing side navigation, top bar, content area, and footer.",
  "frontend/src/components/CustomerDialog.tsx": "Dialog component for creating or editing customers with offline queue integration.",
  "frontend/src/components/ProductDialog.tsx": "Dialog for adding or editing products with validation and offline queue support.",
  "frontend/src/components/SideNav.tsx": "Renders a sidebar with navigation buttons and highlights the active screen.",
  "frontend/src/components/SyncIndicator.tsx": "Displays online status, pending sync count, and sync errors with a retry option.",
  "frontend/src/components/TopBar.tsx": "Shows the app header with sync status, install button, user info, and logout handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state via a React context.",
  "frontend/src/hooks/usePWAInstall.ts": "Tracks PWA install availability and exposes a method to trigger the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, products, and customers using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode, and print-specific rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/offline/storage.ts": "Implements localStorage-backed caching and an offline action queue with timestamps.",
  "frontend/src/offline/useOfflineQueue.ts": "Provides a hook to execute actions with fallback queuing when offline or failing.",
  "frontend/src/offline/useSyncStatus.ts": "Tracks online status, pending offline actions, and processes a local action queue to sync with the backend.",
  "frontend/src/screens/BillingScreen.tsx": "Provides an interface to create bills by selecting customers and products, managing line items, and calculating totals.",
  "frontend/src/screens/CreditsScreen.tsx": "Displays customer credit summaries by aggregating bill data and showing pending credit statuses.",
  "frontend/src/screens/CustomersScreen.tsx": "Lists customers with options to add, edit, or delete them, supporting offline queueing for deletions.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows high‑level business stats like product, customer, bill counts, credits, and pending sync status.",
  "frontend/src/screens/LoginScreen.tsx": "Handles user login via Internet Identity and optional profile setup with name and role selection.",
  "frontend/src/screens/ProductsScreen.tsx": "Displays products with add, edit, and delete actions, using offline queueing and a dialog for editing.",
  "frontend/src/screens/ReportsScreen.tsx": "Generates sales, expense, and profit reports with date filtering and supports creating and deleting expenses.",
  "frontend/src/utils/billingTotals.ts": "Provides functions to compute billing totals with GST and handle legacy bill totals.",
  "frontend/src/utils/printInvoice.ts": "Builds printable HTML invoices by consolidating line items and computing totals.",
  "frontend/src/utils/reporting.ts": "Calculates daily sales, date‑range summaries, and profit including revenue, COGS, and expenses.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH color palette, layout extensions, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Project metadata describing an Android inventory/billing app with MVVM, Firebase offline sync, feature lists, issues, and architectural notes."
}