{
  "backend/main.mo": "Motoko backend implementing authorization plus CRUD operations for products, customers, bills, expenses, and user profiles using Map-based storage.",
  "feature_evidence.json": "Feature evidence listing two frontend features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across app, hooks, components, screens, offline modules, and styles.",
  "frontend/android/.gitignore": "Gitignore rules for Android project build artifacts, logs, IDE files, and temporary directories.",
  "frontend/android/app/build.gradle": "Android build configuration enabling PWA URL validation, custom APK naming, ProGuard, and modern SDK settings.",
  "frontend/android/app/proguard-rules.pro": "ProGuard rules preserving WebView, Kotlin metadata, and wrapper app classes.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android app manifest defining permissions, main activity, deep linking, and app metadata.",
  "frontend/android/app/src/main/java/com/frontline/wrapper/MainActivity.kt": "Main Android activity loading the PWA in a fullscreen WebView with navigation handling, dark mode, and media/geolocation support.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon resource using the same background and foreground setup.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon resource referencing background and foreground assets.",
  "frontend/android/app/src/main/res/values/colors.xml": "Defines launcher icon background color used by adaptive icons.",
  "frontend/android/app/src/main/res/values/strings.xml": "Defines app name, PWA URL, and basic error/loading strings for the Android wrapper.",
  "frontend/android/app/src/main/res/values/styles.xml": "Defines the Android app theme, fullscreen variant, and background color.",
  "frontend/android/build.gradle": "Top-level Gradle config setting Kotlin and Android Gradle plugin versions and repositories.",
  "frontend/android/dist/.gitkeep": "Placeholder to keep the dist directory in version control.",
  "frontend/android/gradle.properties": "Gradle settings enabling AndroidX, Jetifier, R8, Kotlin style, and JVM config.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Specifies the Gradle wrapper distribution URL and related paths.",
  "frontend/android/README.md": "Documentation for the Android wrapper app explaining configuration, PWA URL requirements, and build instructions.",
  "frontend/android/scripts/build-release-apk.sh": "Builds a versioned release APK, validates PWA URL, stages output, and writes build metadata.",
  "frontend/android/scripts/publish-release-apk.sh": "Publishes the built APK by generating publish metadata and preparing a unique download ID.",
  "frontend/android/settings.gradle": "Configures repositories, project name, and includes the app module.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Main HTML entry loading the PWA, icons, manifest, and service worker with build‑ID cache busting.",
  "frontend/public/manifest.webmanifest": "Defines PWA metadata including name, colors, start URL, and icons.",
  "frontend/public/sw.js": "Service worker implementing cache versioning, app‑shell caching, and network/cache strategies.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile loading, screen navigation, and build‑ID cache resets.",
  "frontend/src/components/AppLayout.tsx": "Provides the main app layout with side navigation, mobile drawer, top bar, content area, and footer while managing mobile nav state.",
  "frontend/src/components/AppStartupError.tsx": "Displays a detailed startup error screen with diagnostics, retry, and cache reset options, including special handling for watchdog timeouts.",
  "frontend/src/components/CustomerDialog.tsx": "Dialog for creating or editing customers with form fields, offline queue support, and automatic ID handling.",
  "frontend/src/components/MobileNavDrawer.tsx": "Mobile navigation drawer listing app screens with icons and triggers navigation when items are selected.",
  "frontend/src/components/ProductDialog.tsx": "Dialog for creating or editing products with validation, stock unit conversion, offline queue support, and auto‑incremented IDs.",
  "frontend/src/components/ResponsiveTableCards.tsx": "Renders data as a list of card-like rows or shows an empty state; includes a CardRow helper component.",
  "frontend/src/components/RootErrorBoundary.tsx": "Global error boundary that shows an error screen with reload and reset options when unexpected runtime errors occur.",
  "frontend/src/components/SideNav.tsx": "Sidebar navigation that persists and restores the last selected screen using localStorage and triggers navigation on selection.",
  "frontend/src/components/SyncIndicator.tsx": "Displays online status, pending sync changes, and errors with retry using useSyncStatus.",
  "frontend/src/components/TopBar.tsx": "Renders the app header with menu, sync indicator, PWA install button, user info, and logout handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context and authentication management using Internet Identity and AuthClient.",
  "frontend/src/hooks/usePWAInstall.ts": "Handles PWA installation prompts and installability state via beforeinstallprompt events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, products, customers, and other backend entities using the actor.",
  "frontend/src/hooks/useStartupWatchdog.ts": "Provides a watchdog timer to detect stalled startup phases and capture diagnostic info.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme color variables, and forces fully opaque Radix UI overlays and sheet components.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/offline/storage.ts": "Provides localStorage-based caching and an offline action queue with helpers to add, remove, and manage queued actions.",
  "frontend/src/offline/useOfflineQueue.ts": "React hook that executes actions immediately when online or queues them offline with simple status tracking.",
  "frontend/src/offline/useSyncStatus.ts": "React hook that monitors online status and processes queued offline actions via the backend actor, updating sync and error states.",
  "frontend/src/screens/BillingScreen.tsx": "Billing UI that builds bills with products, calculates totals, and submits or queues bill creation when offline.",
  "frontend/src/screens/CreditsScreen.tsx": "Displays customer credit summaries by aggregating bills and showing pending balances with responsive layouts.",
  "frontend/src/screens/CustomersScreen.tsx": "Displays and manages customers with add, edit, and delete actions, supporting offline queueing and responsive layouts.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows product, customer, bill, and credit stats plus sync status and recent activity summaries.",
  "frontend/src/screens/LoginScreen.tsx": "Handles Internet Identity login and optional profile setup with name and role selection.",
  "frontend/src/screens/ProductsScreen.tsx": "Lists products with add, edit, and delete actions, including stock indicators and offline queue support.",
  "frontend/src/screens/ReportsScreen.tsx": "Generates sales, expense, and profit reports with date filtering and supports creating and deleting expenses offline.",
  "frontend/src/utils/billingTotals.ts": "Provides functions to compute billing totals and GST amounts, including legacy bill handling.",
  "frontend/src/utils/buildInfo.ts": "Exports a build ID used to detect new deployments and refresh caches.",
  "frontend/src/utils/printInvoice.ts": "Generates formatted invoice HTML from bill and customer data and opens a print window; includes logic to consolidate product line items.",
  "frontend/src/utils/reporting.ts": "Provides functions to compute daily sales, date‑range summaries, and profit calculations using bills, products, customers, and expenses.",
  "frontend/src/utils/resetCachedApp.ts": "Clears local/session storage, caches, and service workers, then reloads the page to reset the app state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and enabled plugins.",
  "project_state.json": "Project state metadata describing priorities, architecture notes, known issues, and existing feature implementations."
}