{
  "kind": "build_request",
  "title": "Fix app startup so the Login screen is always reachable and not blocked by loading/profile gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Ensure the application always allows the user to reach and use the Login screen, even if a previous session left `isAuthenticated=true` in localStorage and the backend actor/user profile cannot be fetched (e.g., actor initialization stalls or fails). The app must not remain indefinitely on the full-screen \"Loading...\" state in a way that prevents login interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "login is still not accessable"
        ]
      },
      "acceptanceCriteria": [
        "If the backend actor is unavailable (null) or still initializing, the user can still see a usable Login screen UI (role selector and password input remain interactive; only the Login button may be disabled when appropriate).",
        "If a stored password-auth session causes the app to attempt profile fetch but the profile query cannot run because the actor is not ready, the app must not lock the user into the global loading screen; it must offer a clear path back to login.",
        "All user-facing messages involved in this flow are in English."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add a clear recovery action whenever startup/profile loading fails or stalls that lets the user return to Login by clearing password-auth state (logout/clearAuth) without requiring manual cache clearing. This recovery action must be visible on the relevant error/timeout UI and must not rely only on a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "login is still not accessable"
        ]
      },
      "acceptanceCriteria": [
        "When the startup watchdog timeout screen is shown, there is a visible action (button) that clears the password-auth session and returns the UI to the Login screen.",
        "When the app shows a profile fetch error state (the existing AppStartupError path), the user can choose an option that clears the password-auth session and returns to the Login screen.",
        "Using the recovery action does not leave the app stuck in a loading/disabled state; login inputs remain usable immediately after returning to the Login screen.",
        "All user-facing button labels and help text added/changed are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useInternetIdentity.tsx (immutable).",
    "Do not edit frontend/src/hooks/useActor.ts (immutable). Compose behavior by changing non-immutable components/screens (e.g., App.tsx, screens, and components).",
    "Keep user-facing error normalization behavior consistent with existing toast + normalizeAuthError patterns; do not expose raw technical reject prefixes."
  ],
  "nonGoals": [
    "Do not change the Salesman vs Owner authentication rules or backend authorization behavior as part of this request.",
    "Do not add new authentication providers or third-party login integrations.",
    "Do not redesign non-login screens (Dashboard/Products/Billing/etc.) beyond what is necessary to prevent login inaccessibility."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}