{
  "kind": "build_request",
  "title": "Fix 'Unable to connect to server' during Owner/Salesman login",
  "projectName": "Frontline Distributors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add actionable diagnostics to the login/startup flow so that when the app shows “Unable to connect to server”, the UI also displays the underlying actor/agent initialization error (if any) and provides retry actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "its showing unable to connect to server"
        ]
      },
      "acceptanceCriteria": [
        "When actor creation fails, the user sees a clear error state that includes the normalized error message and an expandable “Technical Details” section (similar to AppStartupError) rather than only a generic “Unable to connect to server”.",
        "The error state provides working actions to Retry (re-attempt actor initialization) and Clear Cache (calls the existing resetCachedApp()).",
        "The login screen no longer stays indefinitely in “Connecting to server...” without a visible error when the actor query fails."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the actor initialization hook to surface failures (error + status) to the rest of the app, instead of returning only a null actor and causing downstream code to emit a generic connection error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "its showing unable to connect to server"
        ]
      },
      "acceptanceCriteria": [
        "useActor returns enough state to distinguish: (a) still initializing, (b) initialized successfully, (c) failed with error.",
        "LoginScreen can render different messaging for “connecting” vs “failed to connect”, based on the hook’s state, without relying on thrown 'Unable to connect to server' from mutations.",
        "If actor initialization fails, the captured error is logged to console and is available for display in the UI diagnostics view."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make actor initialization resilient to missing/empty admin secret parameter so that the anonymous actor can still be created and used for password login without failing due to secret-based access-control initialization.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "its showing unable to connect to server"
        ]
      },
      "acceptanceCriteria": [
        "If the URL parameter `caffeineAdminToken` is absent or empty, the app does not fail actor initialization solely because of secret initialization; the app continues to load and allows password login attempts.",
        "If secret initialization fails for any reason, the app still provides a clear error with diagnostics instead of silently leaving the actor null.",
        "Owner and Salesman login mutations no longer fail with 'Unable to connect to server' when the only issue is missing admin token in the URL."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; introduce migration.mo only if persistent state schema changes are required.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers (only the existing password-based flow and existing Internet Identity support remain).",
    "Introducing external databases, third-party services, or websocket-based realtime connectivity.",
    "Changing the Owner/Salesman password values."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}