{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unblock Login during stalled startup/profile gating and add recovery actions",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Prevent global startup loading/profile gating from blocking access to an interactive Login screen when actor/profile cannot be fetched.",
      "acceptanceCriteria": [
        "If the backend actor is unavailable (null) or still initializing, the user can still see a usable Login screen UI (role selector and password input remain interactive; only the Login button may be disabled when appropriate).",
        "If a stored password-auth session causes the app to attempt profile fetch but the profile query cannot run because the actor is not ready, the app must not lock the user into the global loading screen; it must offer a clear path back to login.",
        "All user-facing messages involved in this flow are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust startup gating so the app does not enter an indefinite full-screen \"Loading...\" state when password-auth is restored but the actor is unavailable/initializing (i.e., profile fetching is not yet possible). Ensure the LoginScreen can render in that scenario, with login inputs remaining usable and only the Login button disabled when the actor is not ready."
        },
        {
          "path": "frontend/src/screens/LoginScreen.tsx",
          "operation": "modify",
          "description": "Ensure the Login screen remains fully interactive during actor initialization failures/stalls (keep role selector + password input enabled) and show clear English connection status messaging while keeping only the Login button disabled when the actor is not ready."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add visible recovery actions on startup timeout and profile-fetch error screens to clear password-auth state and return to Login without requiring a full reload.",
      "acceptanceCriteria": [
        "When the startup watchdog timeout screen is shown, there is a visible action (button) that clears the password-auth session and returns the UI to the Login screen.",
        "When the app shows a profile fetch error state (the existing AppStartupError path), the user can choose an option that clears the password-auth session and returns to the Login screen.",
        "Using the recovery action does not leave the app stuck in a loading/disabled state; login inputs remain usable immediately after returning to the Login screen.",
        "All user-facing button labels and help text added/changed are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppStartupError.tsx",
          "operation": "modify",
          "description": "Add an explicit recovery control (button) for non-auth startup failures and watchdog timeouts that can clear password-auth state and route the user back to Login (without relying only on a full page reload). Update error text rendering to use the existing auth error normalization approach (normalizeAuthError) to avoid exposing raw technical reject prefixes."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire AppStartupError recovery actions for both watchdog timeout and profile-fetch error paths by providing a clearAuth/return-to-login handler (clearing password-auth state and any cached client state as appropriate) and ensuring the post-recovery UI shows an immediately usable Login screen."
        },
        {
          "path": "frontend/src/screens/LoginScreen.tsx",
          "operation": "modify",
          "description": "Add a visible recovery action on the Login screen for stalled startup situations (e.g., a \"Clear Saved Session\" / \"Log out\" control) that clears password-auth state and immediately re-enables login inputs, without requiring manual cache clearing."
        }
      ]
    }
  ]
}