{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Regenerate Android wrapper APK (version bump + valid PWA URL config)",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Make the Android wrapper project able to reliably produce a fresh release APK artifact and document the standard steps for publishing a new downloadable artifact/link.",
      "acceptanceCriteria": [
        "A new release APK artifact is produced from the current codebase in frontend/android.",
        "The build output includes a new APK download URL that is reachable from both mobile and desktop browsers.",
        "The previously provided URL https://api.caffeine.build/download/apk/frontline-distributors/latest is not reused unless it is verified working; if a new URL is generated, it is included verbatim in the build output."
      ],
      "file_operations": [
        {
          "path": "frontend/android/README.md",
          "operation": "modify",
          "description": "Update the Android wrapper build documentation to (1) build a release APK from the current codebase, (2) locate the generated APK output path, and (3) publish it through the standard build artifact flow so a new reachable download URL is produced and shared in the build output."
        },
        {
          "path": "frontend/android/scripts/build-release-apk.sh",
          "operation": "create",
          "description": "Add a small helper script to run the release build for the wrapper (using the Gradle wrapper), and print the expected release APK output file location so the artifact can be uploaded/published to generate a new reachable download URL."
        },
        {
          "path": "frontend/android/app/build.gradle",
          "operation": "modify",
          "description": "Adjust release APK artifact naming (e.g., include app/version in output naming where supported) so the regenerated APK is easy to identify when publishing it as a new downloadable release artifact."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Bump Android wrapper versionCode and versionName so the regenerated APK is distinguishable from prior builds.",
      "acceptanceCriteria": [
        "frontend/android/app/build.gradle has an incremented versionCode compared to the current value (1).",
        "frontend/android/app/build.gradle has an updated versionName compared to the current value (\"1.0\").",
        "The generated APK reports the new versionCode/versionName when inspected in Android app info after installation."
      ],
      "file_operations": [
        {
          "path": "frontend/android/app/build.gradle",
          "operation": "modify",
          "description": "Increment versionCode (currently 1) and update versionName (currently \"1.0\") in defaultConfig so the rebuilt release APK installs as a distinct version and reports the new values in Android App Info."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Ensure the Android wrapper release build loads a real deployed PWA URL via the pwa_url string resource (not the placeholder).",
      "acceptanceCriteria": [
        "frontend/android/app/src/main/res/values/strings.xml does not ship with the placeholder value \"https://your-canister-id.ic0.app\" for pwa_url in the release APK.",
        "After installing the regenerated APK, the app opens and loads the PWA successfully on a device with internet access."
      ],
      "file_operations": [
        {
          "path": "frontend/android/app/src/main/res/values/strings.xml",
          "operation": "modify",
          "description": "Replace the placeholder pwa_url value (currently \"https://your-canister-id.ic0.app\") with the valid deployed PWA URL intended for the wrapper’s release build so the placeholder is not shipped."
        },
        {
          "path": "frontend/android/app/build.gradle",
          "operation": "modify",
          "description": "Add a release-build validation step to prevent producing a release APK if the pwa_url resource is still set to the placeholder (or otherwise invalid), ensuring the generated release APK always targets a valid deployed PWA URL."
        },
        {
          "path": "frontend/android/gradle.properties",
          "operation": "modify",
          "description": "Optionally support configuring the deployed PWA URL via a Gradle property for release builds (so CI/build environments can inject the correct deployed URL), while still ensuring the shipped release APK never uses the placeholder value."
        }
      ]
    }
  ]
}