{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add actor init diagnostics + resilient login connection handling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show actionable actor/agent initialization diagnostics on login when connection fails, with Retry and Clear Cache actions.",
      "acceptanceCriteria": [
        "When actor creation fails, the user sees a clear error state that includes the normalized error message and an expandable “Technical Details” section (similar to AppStartupError) rather than only a generic “Unable to connect to server”.",
        "The error state provides working actions to Retry (re-attempt actor initialization) and Clear Cache (calls the existing resetCachedApp()).",
        "The login screen no longer stays indefinitely in “Connecting to server...” without a visible error when the actor query fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/LoginScreen.tsx",
          "operation": "modify",
          "description": "Render distinct UI states for actor initialization: connecting vs failed. When failed, show a visible error card that includes (1) a normalized error message (reuse normalizeAuthError), (2) an expandable 'Technical Details' section (raw error + query status metadata), and (3) working actions for Retry (trigger actor re-initialization) and Clear Cache (call resetCachedApp()). Ensure the previous 'Connecting to server...' alert is replaced/augmented so it cannot spin indefinitely when the underlying actor query is in an error state."
        },
        {
          "path": "frontend/src/components/AppStartupError.tsx",
          "operation": "modify",
          "description": "Extend AppStartupError with an optional compact/embedded rendering mode suitable for use on the LoginScreen, while preserving existing full-page behavior. Keep the same 'Technical Details' expansion pattern to satisfy diagnostics UX consistency."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Surface actor initialization status and error to the app via a wrapper hook, enabling LoginScreen to render based on init state rather than mutation-thrown generic errors.",
      "acceptanceCriteria": [
        "useActor returns enough state to distinguish: (a) still initializing, (b) initialized successfully, (c) failed with error.",
        "LoginScreen can render different messaging for “connecting” vs “failed to connect”, based on the hook’s state, without relying on thrown 'Unable to connect to server' from mutations.",
        "If actor initialization fails, the captured error is logged to console and is available for display in the UI diagnostics view."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorStatus.ts",
          "operation": "create",
          "description": "Create a new hook that composes the immutable useActor() and React Query's query cache to expose actor initialization state: { actor, status: 'initializing' | 'ready' | 'error', error, isFetching, retry() }. Derive error/status by reading the underlying actor query state from the QueryClient (using the same queryKey pattern used by useActor), and log initialization failures to console. This hook is the single source of truth for UI diagnostics."
        },
        {
          "path": "frontend/src/screens/LoginScreen.tsx",
          "operation": "modify",
          "description": "Switch actor readiness and messaging logic to use useActorStatus (or similarly named wrapper) so the screen can distinguish 'connecting' vs 'failed'. Ensure the displayed diagnostics view uses the hook-provided error and status rather than relying on mutation exceptions."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update password-login mutations (useLoginAsOwner/useLoginAsSalesman) to avoid throwing a generic 'Unable to connect to server' when actor is null. Instead, consult the actor init state (via query cache state or the new useActorStatus hook) and throw an Error that reflects: (a) initializing (user-facing: still connecting) vs (b) failed (propagate the captured init error message). Keep console logging for unexpected failures so the UI can present diagnostics without masking root causes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Prevent missing/empty caffeineAdminToken from blocking password-login actor creation by providing a safe fallback path and clear diagnostics when secret initialization fails.",
      "acceptanceCriteria": [
        "If the URL parameter `caffeineAdminToken` is absent or empty, the app does not fail actor initialization solely because of secret initialization; the app continues to load and allows password login attempts.",
        "If secret initialization fails for any reason, the app still provides a clear error with diagnostics instead of silently leaving the actor null.",
        "Owner and Salesman login mutations no longer fail with 'Unable to connect to server' when the only issue is missing admin token in the URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/LoginScreen.tsx",
          "operation": "modify",
          "description": "In the actor-init failure UI, detect likely secret/admin-token related failures (based on error text and/or the absence of getSecretParameter('caffeineAdminToken')). Provide an additional recovery action: 'Continue without admin token' that clears any stored caffeineAdminToken (sessionStorage) and clears Internet Identity state (useInternetIdentity().clear()) to force a retry using an anonymous actor, enabling password login even when secret-based initialization fails. Also ensure that when secret initialization fails, the same diagnostics card (normalized error + Technical Details) is shown instead of leaving the actor null with only generic messaging."
        },
        {
          "path": "frontend/src/hooks/useActorStatus.ts",
          "operation": "modify",
          "description": "Include minimal structured diagnostics for display (e.g., whether a caffeineAdminToken is present, current identity principal string if available, and the actor query status). This enables the LoginScreen 'Technical Details' section to clearly show when missing/empty token is the likely cause, and supports reliable retry behavior after clearing token/identity."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Expose or add a small helper to explicitly clear the persisted secret/session parameter for `caffeineAdminToken` (without changing existing secret-handling behavior). This is used by the LoginScreen recovery action to remove stale/empty secret state before retrying actor initialization."
        }
      ]
    }
  ]
}